libdriver/ds1307/project/stm32f407/interface/inc/iic.h
/**
 * Copyright (c) 2015 - present LibDriver All rights reserved
 * 
 * The MIT License (MIT)
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy
 * of this software and associated documentation files (the "Software"), to deal
 * in the Software without restriction, including without limitation the rights
 * to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
 * copies of the Software, and to permit persons to whom the Software is
 * furnished to do so, subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included in all
 * copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
 * AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
 * LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
 * OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
 * SOFTWARE. 
 *
 * @file      iic.h
 * @brief     iic header file
 * @version   1.0.0
 * @author    Shifeng Li
 * @date      2023-02-01
 *
 * <h3>history</h3>
 * <table>
 * <tr><th>Date        <th>Version  <th>Author      <th>Description
 * <tr><td>2023/02/01  <td>1.0      <td>Shifeng Li  <td>first upload
 * </table>
 */

#ifndef IIC_H
#define IIC_H

#include "stm32f4xx_hal.h"

#ifdef __cplusplus
 extern "C" {
#endif

/**
 * @defgroup iic iic function
 * @brief    iic function modules
 * @ingroup  interface
 * @{
 */

/**
 * @brief  iic init
 * @return status code
 *         - 0 success
 *         - 1 init failed
 * @note   SCL is PH4
 *         SDA is PH5
 */
uint8_t iic_init(void);

/**
 * @brief  iic deinit
 * @return status code
 *         - 0 success
 *         - 1 deinit failed
 * @note   none
 */
uint8_t iic_deinit(void);

/**
 * @brief     iic write command
 * @param[in] addr is the iic device write address
 * @param[in] *buf points to a buffer address
 * @param[in] len is the buffer length
 * @return    status code
 *            - 0 success
 *            - 1 write failed
 *            - 2 timeout
 *            - 3 locked
 *            - 4 iic error
 * @note      none
 */
uint8_t iic_write_command(uint8_t addr, uint8_t *buf, uint16_t len);

/**
 * @brief      iic read command
 * @param[in]  addr is the iic device write address
 * @param[out] *buf points to a buffer address
 * @param[in]  len is the buffer length
 * @return     status code
 *             - 0 success
 *             - 1 read failed
 *             - 2 timeout
 *             - 3 locked
 *             - 4 iic error
 * @note       none
 */
uint8_t iic_read_command(uint8_t addr, uint8_t *buf, uint16_t len);

/**
 * @brief      iic read
 * @param[in]  addr is the iic device write address
 * @param[in]  reg is the register address
 * @param[out] *buf points to a buffer address
 * @param[in]  len is the buffer length
 * @return     status code
 *             - 0 success
 *             - 1 read failed
 *             - 2 timeout
 *             - 3 locked
 *             - 4 iic error
 * @note       none
 */
uint8_t iic_read(uint8_t addr, uint8_t reg, uint8_t *buf, uint16_t len);

/**
 * @brief     iic write
 * @param[in] addr is the iic device write address
 * @param[in] reg is the register address
 * @param[in] *buf points to a buffer address
 * @param[in] len is the buffer length
 * @return    status code
 *            - 0 success
 *            - 1 write failed
 *            - 2 timeout
 *            - 3 locked
 *            - 4 iic error
 * @note      none
 */
uint8_t iic_write(uint8_t addr, uint8_t reg, uint8_t *buf, uint16_t len);

/**
 * @brief      iic read address16
 * @param[in]  addr is the iic device write address
 * @param[in]  reg is the register address
 * @param[out] *buf points to a buffer address
 * @param[in]  len is the buffer length
 * @return     status code
 *             - 0 success
 *             - 1 read failed
 *             - 2 timeout
 *             - 3 locked
 *             - 4 iic error
 * @note       none
 */
uint8_t iic_read_address16(uint8_t addr, uint16_t reg, uint8_t *buf, uint16_t len);

/**
 * @brief     iic write address16
 * @param[in] addr is the iic device write address
 * @param[in] reg is the register address
 * @param[in] *buf points to a buffer address
 * @param[in] len is the buffer length
 * @return    status code
 *            - 0 success
 *            - 1 write failed
 *            - 2 timeout
 *            - 3 locked
 *            - 4 iic error
 * @note      none
 */
uint8_t iic_write_address16(uint8_t addr, uint16_t reg, uint8_t *buf, uint16_t len);

/**
 * @}
 */

/**
 * @addtogroup port
 * @{
 */

/**
 * @brief  get the iic tx dma handle
 * @return points to a tx dma handle
 * @note   none
 */
DMA_HandleTypeDef* iic_get_tx_dma_handle(void);

/**
 * @brief  get the iic rx dma handle
 * @return points to a rx dma handle
 * @note   none
 */
DMA_HandleTypeDef* iic_get_rx_dma_handle(void);

/**
 * @brief  get the iic handle
 * @return points to an iic handle
 * @note   none
 */
I2C_HandleTypeDef* iic_get_handle(void);

/**
 * @brief iic set tx done
 * @note  none
 */
void iic_set_tx_done(void);

/**
 * @brief iic set rx done
 * @note  none
 */
void iic_set_rx_done(void);

/**
 * @brief iic set error
 * @note  none
 */
void iic_set_error(void);

/**
 * @}
 */

#ifdef __cplusplus
}
#endif

#endif
